In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [2]:
%%sql
CREATE TABLE Customer_Data (
    id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    email VARCHAR(100),
    phone_number VARCHAR(15),
    address VARCHAR(200),
    amount DECIMAL(10, 2)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [3]:
%%sql
INSERT INTO Customer_Data VALUES
(1, 'Ravi', 'ravi@example.com', '9876', 'Chennai', 5000.00),
(2, 'Priya', NULL, '9876', 'Bangalore', NULL),
(3, 'Arjun', 'arjun@example.com', NULL, 'Hyderabad', 1500.00),
(4, 'Meena', NULL, NULL, 'Mumbai', 2500.00),
(5, 'Karthik', 'karthik@example.com', '9876', NULL, 3000.00);

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[]

In [7]:
%%sql
SELECT 
    COUNT(*) AS null_phone_count 
FROM 
    Customer_Data 
WHERE 
    phone_number IS not NULL;  #NOTNULL
    phone_number IS NULL; #NULL

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(3,)]

In [6]:
%%sql
select * from customer_data

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[(1, 'Ravi', 'ravi@example.com', '9876', 'Chennai', Decimal('5000.00')),
 (2, 'Priya', None, '9876', 'Bangalore', None),
 (3, 'Arjun', 'arjun@example.com', None, 'Hyderabad', Decimal('1500.00')),
 (4, 'Meena', None, None, 'Mumbai', Decimal('2500.00')),
 (5, 'Karthik', 'karthik@example.com', '9876', None, Decimal('3000.00'))]

In [9]:
%%sql
SELECT 
    id, 
    customer_name, 
    email, 
    phone_number, 
    address 
FROM 
    Customer_Data 
WHERE 
    email IS NULL 
    OR phone_number IS NULL 
    OR address IS NULL;

 * mysql+mysqlconnector://root:***@localhost/test
4 rows affected.

[(2, 'Priya', None, '9876', 'Bangalore'),
 (3, 'Arjun', 'arjun@example.com', None, 'Hyderabad'),
 (4, 'Meena', None, None, 'Mumbai'),
 (5, 'Karthik', 'karthik@example.com', '9876', None)]

In [ ]:
#HERE WE HAVE GENERAL NULL VALUE EX:NONE AND STRING NULL EXAMPLE:'NULL'

In [ ]:
#COALESCE TOPIC WHERE WE HANDLE NULL VALUE TO REPRESENT SAMPLE VALUE EX: AMOUNT (0.00)

In [11]:
%%sql
SELECT 
    customer_name, 
    COALESCE(amount, 0.00) AS adjusted_amount #COALESCE
FROM 
    Customer_Data;

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[('Ravi', Decimal('5000.00')),
 ('Priya', Decimal('0.00')),
 ('Arjun', Decimal('1500.00')),
 ('Meena', Decimal('2500.00')),
 ('Karthik', Decimal('3000.00'))]

In [12]:
%%sql
select coalesce(null,null,null,'0.00',null,'11') #COALESCE WILL SEE NULl OR ARGUMENTS MANY TIME THEN CHECK FIRST OCCURANCE OF NOT NULL VALUE HERE(0.00)
#FIRST NOT NULL VALUE

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[('0.00',)]

In [ ]:
#IFNULL

In [13]:
%%sql
SELECT customer_name, IFNULL(amount, 0) AS adjusted_amount FROM Customer_Data;

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[('Ravi', Decimal('5000.00')),
 ('Priya', Decimal('0.00')),
 ('Arjun', Decimal('1500.00')),
 ('Meena', Decimal('2500.00')),
 ('Karthik', Decimal('3000.00'))]

In [14]:
%%sql
alter table Customer_Data rename column address to city

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [15]:
%%sql
select * from Customer_Data

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[(1, 'Ravi', 'ravi@example.com', '9876', 'Chennai', Decimal('5000.00')),
 (2, 'Priya', None, '9876', 'Bangalore', None),
 (3, 'Arjun', 'arjun@example.com', None, 'Hyderabad', Decimal('1500.00')),
 (4, 'Meena', None, None, 'Mumbai', Decimal('2500.00')),
 (5, 'Karthik', 'karthik@example.com', '9876', None, Decimal('3000.00'))]

In [ ]:
#STRING HANDLING TOPICS

In [33]:
%%sql
select id,
customer_name, 
length(customer_name) as cust_length,
upper(city) as upp_city,
lower(city) as low_city,
upper(concat(customer_name,'-',city,'-','TN')) as concat_cust, #multiple functions
substring(customer_name,1,4) as sub_cust,
lpad(Customer_name,8,'*') as pad_cust,
rpad(Customer_name,8,'*') as pad_cust,
LEFT(customer_name, 4) AS first_5_chars,
RIGHT(customer_name, 4) AS last_5_chars,
TRIM('   ExampleCity   ') AS trimmed_city,
REPLACE(customer_name, ' ', '_') AS updated_name,
INSTR(customer_name, 'a') AS position_of_a,
REVERSE(customer_name) AS reversed_name,
FORMAT(9876543210, 2) AS formatted_number

from 
Customer_Data;

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[(1, 'Ravi', 4, 'CHENNAI', 'chennai', 'RAVI-CHENNAI-TN', 'Ravi', '****Ravi', 'Ravi****', 'Ravi', 'Ravi', 'ExampleCity', 'Ravi', 2, 'ivaR', '9,876,543,210.00'),
 (2, 'Priya', 5, 'BANGALORE', 'bangalore', 'PRIYA-BANGALORE-TN', 'Priy', '***Priya', 'Priya***', 'Priy', 'riya', 'ExampleCity', 'Priya', 5, 'ayirP', '9,876,543,210.00'),
 (3, 'Arjun', 5, 'HYDERABAD', 'hyderabad', 'ARJUN-HYDERABAD-TN', 'Arju', '***Arjun', 'Arjun***', 'Arju', 'rjun', 'ExampleCity', 'Arjun', 1, 'nujrA', '9,876,543,210.00'),
 (4, 'Meena', 5, 'MUMBAI', 'mumbai', 'MEENA-MUMBAI-TN', 'Meen', '***Meena', 'Meena***', 'Meen', 'eena', 'ExampleCity', 'Meena', 5, 'aneeM', '9,876,543,210.00'),
 (5, 'Karthik', 7, None, None, None, 'Kart', '*Karthik', 'Karthik*', 'Kart', 'thik', 'ExampleCity', 'Karthik', 2, 'kihtraK', '9,876,543,210.00')]